ПД_sev/src/Catalogs/МП_ВнешниеУстройства/МП_ВнешниеУстройства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МП_ВнешниеУстройства</name>
  <attributes>
    <name>ИмяУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БессрочноАктивноеУстройство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУстройства</name>
    <type>
      <types>EnumRef.МП_ВидУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДPush</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ПД_sev/src/InformationRegisters/МП_ЗначениеПравТСД/МП_ЗначениеПравТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_ЗначениеПравТСД</name>
  <resources>
    <name>ЗначениеПрава</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.МП_ВнешниеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Право</name>
    <type>
      <types>CatalogRef.МП_ДополнительныеПраваТСД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ПД_sev/src/Catalogs/МП_ВнешниеУстройства/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьначенияДополнительныхПрав();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьначенияДополнительныхПрав()
	ТЗ = Справочники.МП_ВнешниеУстройства.ПолучитьТЗДополнительныхПрав(Объект.Ссылка);
	ТаблицаДополнительныйПрава.Загрузить(ТЗ);	
КонецПроцедуры // ЗаполнитьТаблицуДопПрав()

&НаСервере
Процедура ЗаписатьЗначенияДопПравСервер()
	ТЗ = РеквизитФормыВЗначение("ТаблицаДополнительныйПрава", Тип("ТаблицаЗначений"));
	НаборЗаписей = РегистрыСведений.МП_ЗначениеПравТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект.Ссылка);
	Для Каждого СтрокаСвойство ИЗ ТЗ Цикл 
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Объект = Объект.Ссылка;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаСвойство, "Право, ЗначениеПрава");
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры // ЗаполнитьТаблицуДопПрав()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//ЗаписатьЗначенияДопПравСервер();
КонецПроцедуры

&НаСервере
Функция ОтправитьPushСообщениеНаСервере(Сообщение)
	стрПараметры = Новый Структура;
	стрПараметры.Вставить("ТекстСообщения", Сообщение);
	стрПараметры.Вставить("Заголовок", "testmessage");
	Возврат ИнтеграцияСВнешнимиСистемамиСервер.ОтправитьPushСообщение(Объект.Ссылка,стрПараметры); 	
КонецФункции

&НаКлиенте
Процедура ОтправитьPushСообщение(Команда)
	Перем Сообщение;
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Перед отправкой необходимо записать элемент!");
		Возврат
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ИДPush) Тогда
		Сообщить("Не заполнен идентификатор(ИДPush) устройства для отправки push сообщений!");
		Возврат
	КонецЕсли;
	Если ВвестиСтроку(Сообщение, "Введите сообщение для отправки") Тогда
		Результат = ОтправитьPushСообщениеНаСервере(Сообщение);
		Если Результат Тогда
			Сообщить("Сообщение успешно отправлено!");
		Иначе
			Сообщить("Не удалось отправить сообщение!");
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
